Repository: TenderShootTM/centeroflove
Catalog: *.po
Languages: ar

source: Our Stories
ar: seirotS ruO

source: Oddly we have no stories.
ar: Oddly we have no stories [ar].

source: center of love
ar: evol fo retnec

source: home
ar: emoh

source: about us
ar: su tuoba

source: our stories
ar: seirots ruo

source: how to help
ar: pleh ot woh

source: Get Involved!
ar: devlovnI teG!

source: Pray
ar: yarP

source: Volunteer
ar: reetnuloV

source: Donate
ar: etanoD

source: Connect
ar: tcennoC

source: pray
ar: yarp

source: volunteer
ar: reetnulov

source: donate
ar: etanod

source: connect
ar: tcennoc

source: No featured story today.
ar: No featured story today [ar].

source: who are we?
ar: ew era ohw?

source: No new story today.
ar: No new story today [ar].

source: More Posts
ar: stsoP eroM

source: Read More
ar: eroM daeR

source: Prayer Requests
ar: stseuqeR reyarP

source: Facebook
ar: koobecaF

source: Email
ar: liamE

source: RSS Feed
ar: RSS deeF

source: Oddly this page does not exist.
ar: Oddly this page does not exist [ar].

source: Search Results:
ar: stluseR hcraeS:

source: No search results found for
ar: No search results found for [ar]

source: Search
ar: hcraeS

source: Sorry, no posts matched your criteria.
ar: Sorry, no posts matched your criteria [ar].
